#ifndef __XENO__
#define __XENO__
#endif

//-system-/////////////////////////////////////////////////////////////////
#include <stdio.h>
#include <stdlib.h>
#include <signal.h>
#include <unistd.h>
#include <sys/mman.h>
#include <string.h>
#include <fcntl.h>
#include <errno.h>
#include <termios.h>
#include <time.h>
#include <sys/ioctl.h>
#include <math.h>

//-xenomai-///////////////////////////////////////////////////////////////
#include <native/task.h>
#include <native/sem.h>
#include <native/mutex.h>
#include <native/timer.h>
#include <rtdk.h>
#define ms(x) (x*1000000)

// ROS
#include <ros/ros.h>
#include <std_msgs/Int16.h>
#include <boost/bind.hpp>

#include "ndr_downscale/one.h"
#include "ndr_downscale/two.h"
#include "ndr_downscale/three.h"
#include "ndr_downscale/six.h"
#include "ndr_downscale/seven.h"
#include "ndr_downscale/twentyone.h"

#include <iostream>
#include <sstream>
#include <getopt.h>
#include <list>

// External libraries
#include "../include/Eigen/Dense"
#include "../include/Eigen/Core"
#include "std_msgs/Float64MultiArray.h"
#include "std_msgs/Int32.h"
#include "std_msgs/Int16.h"
#include "std_msgs/Float64.h"
#include "std_msgs/Int32MultiArray.h"
//time measure
#include <chrono>

// EtherCAT
#include "ecrt.h"

typedef unsigned int UINT32;
typedef int32_t INT32;
typedef int16_t INT16;
typedef uint16_t UINT16;
typedef uint8_t UINT8;
typedef int8_t INT8;


	{0x6000,	22,	16},	/* RawTz */
	{0x6000,	23,	8},		/* OverloadStatus */
	{0x6000,	24,	8},		/* ErrorFlag */
};

ec_pdo_info_t Robotous_RFT_EC02_pdos[] = {
    {0x1600,	2,	Robotous_RFT_EC02_pdo_entries + 0},	/* RxPdo	0x1600: 2 entries */
	{0x1A00,	24,	Robotous_RFT_EC02_pdo_entries + 2},	/* TxPdo	0x1A00: 24 entries */
};

ec_sync_info_t Robotous_RFT_EC02_syncs[] = 
{ 
	{0, EC_DIR_OUTPUT	, 0, NULL, EC_WD_ENABLE}, 
	{1, EC_DIR_INPUT	, 0, NULL, EC_WD_ENABLE}, 
	{2, EC_DIR_OUTPUT	, 1, Robotous_RFT_EC02_pdos + 0, EC_WD_ENABLE}, 
	{3, EC_DIR_INPUT	, 1, Robotous_RFT_EC02_pdos + 1, EC_WD_ENABLE}, 
	{0xff} 
};

ec_pdo_entry_info_t Servotronix_motion_control_ltd__CDHD_pdo_entries[] = 
{ 
	{0x6040,	0,	16},	/* ControlWord 				-- RxPdo1	0x1600*/		
	{0x6060,	0,	8},		/* ModeOfOperation */
	{0x607a,	0,	32},	/* TargetPosition 			-- RxPdo2	0x1601*/
	{0x6081,	0,	32},	/* ProfileVelocity */
	{0x60ff,	0,	32},	/* TargetVelocity *			-- RxPdo3	0x1602*/
	{0x6071,	0,	16},	/* TargetTorque 			-- RxPdo4	0x1603*/
	{0x60fe,	1,	32},	/* DigitalOutpus */
	{0x60b2,	0,	16},	/* TorqueOffset */
	{0x6041,	0,	16},	/* StatusWord				-- TxPdo1	0x1A00*/
	{0x6061,	0,	8},		/* ModeOfOperationDisplay*/
	{0x6077,	0,	16},	/* TorqueActualValue */
	{0x6064,	0,	32},	/* PositionActualValue		-- TxPdo2	0x1A01*/
	{0x6074,	0,	16},	/* TorqueDemandValue		-- TxPdo3	0x1A02*/
	{0x20f2,	0,	16},	/* AnalogInput1*/
	{0x60fd,	0,	32},	/* DigitalInputs			-- TxPdo4	0x1A03*/
	{0x20b6,	0,	32},	/* ManuspecMachineHWPositionExternalcommand */
	{0x60f4,	0,	32},	/* FollowingErrorActualValue*/
};

ec_pdo_info_t Servotronix_motion_control_ltd__CDHD_pdos[] = {
    {0x1600,	2,	Servotronix_motion_control_ltd__CDHD_pdo_entries + 0},	/* RxPdo1	0x1600: 2 entries */
	{0x1601,	2,	Servotronix_motion_control_ltd__CDHD_pdo_entries + 2},	/* RxPdo2	0x1601: 2 entries */
	{0x1602,	1,	Servotronix_motion_control_ltd__CDHD_pdo_entries + 4},	/* RxPdo3	0x1602: 1 entries */
	{0x1603,	3,	Servotronix_motion_control_ltd__CDHD_pdo_entries + 5},	/* RxPdo4	0x1603: 3 entries */
	{0x1A00,	3,	Servotronix_motion_control_ltd__CDHD_pdo_entries + 8},	/* TxPdo1	0x1A00: 3 entries */
	{0x1A01,	1,	Servotronix_motion_control_ltd__CDHD_pdo_entries + 11},	/* TxPdo2	0x1A01: 1 entries */
	{0x1A02,	2,	Servotronix_motion_control_ltd__CDHD_pdo_entries + 12},	/* TxPdo3	0x1A02: 2 entries */
	{0x1A03,	3,	Servotronix_motion_control_ltd__CDHD_pdo_entries + 14},	/* TxPdo4	0x1A02: 3 entries */
};

// ec_sync_info_t Servotronix_motion_control_ltd__CDHD_syncs[] = 
// { 
// 	{0, EC_DIR_OUTPUT	, 0, NULL, EC_WD_ENABLE}, 
// 	{1, EC_DIR_INPUT	, 0, NULL, EC_WD_ENABLE}, 
// 	{2, EC_DIR_OUTPUT	, 4, Robotous_RFT_EC02_pdos + 0, EC_WD_ENABLE}, 
// 	{3, EC_DIR_INPUT	, 4, Robotous_RFT_EC02_pdos + 4, EC_WD_ENABLE}, 
// 	{0xff} 
// };

ec_sync_info_t Servotronix_motion_control_ltd__CDHD_syncs[] = {
	{0, EC_DIR_INPUT, 8, Servotronix_motion_control_ltd__CDHD_pdos + 0, EC_WD_ENABLE}, 
	{0xff}
};

/****************************************************************************/
// Struct
/********downscale************/

struct ROBOTOUS_RFT_EC02_IN
{
	uint32_t		ConfigParam1; 	// 0x7000
	uint32_t		ConfigParam2; 	// 0x7000			
};
struct ROBOTOUS_RFT_EC02_OUT
{
    uint8_t		DF1; 	// 0x6000
	uint8_t		DF2; 	// 0x6000
	uint8_t		DF3; 	// 0x6000
	uint8_t		DF4; 	// 0x6000
	uint8_t		DF5; 	// 0x6000
	uint8_t		DF6; 	// 0x6000
	uint8_t		DF7; 	// 0x6000
	uint8_t		DF8; 	// 0x6000
	uint8_t		DF9; 	// 0x6000
	uint8_t		DF10; 	// 0x6000
	uint8_t		DF11; 	// 0x6000
	uint8_t		DF12; 	// 0x6000
	uint8_t		DF13; 	// 0x6000
	uint8_t		DF14; 	// 0x6000
	uint8_t		DF15; 	// 0x6000
	uint8_t		DF16; 	// 0x6000
	int16_t		RawFx; 	// 0x6000
	int16_t		RawFy; 	// 0x6000
	int16_t		RawFz; 	// 0x6000
	int16_t		RawTx; 	// 0x6000
	int16_t		RawTy; 	// 0x6000
	int16_t		RawTz; 	// 0x6000
	uint8_t		OverloadStatus; 	// 0x6000
	uint8_t		ErrorFlag; 	// 0x6000				
};
struct ROBOTOUS_RFT_EC02
{
    ec_slave_config_t* Config;
    
    ROBOTOUS_RFT_EC02_IN 	InParam;
	ROBOTOUS_RFT_EC02_OUT 	OutParam;
	
	uint32_t offConfigParam1;
	uint32_t offConfigParam2;
	uint32_t offDF1;
	uint32_t offDF2;
	uint32_t offDF3;
	uint32_t offDF4;
	uint32_t offDF5;
	uint32_t offDF6;
	uint32_t offDF7;
	uint32_t offDF8;
	uint32_t offDF9;
	uint32_t offDF10;
	uint32_t offDF11;
	uint32_t offDF12;
	uint32_t offDF13;
	uint32_t offDF14;
	uint32_t offDF15;
	uint32_t offDF16;
	uint32_t offRawFx;
	uint32_t offRawFy;
	uint32_t offRawFz;
	uint32_t offRawTx;
	uint32_t offRawTy;
	uint32_t offRawTz;
	uint32_t offOverloadStatus;
	uint32_t offErrorFlag;
	uint32_t bitoffConfigParam1;
	uint32_t bitoffConfigParam2;
	uint32_t bitoffDF1;
	uint32_t bitoffDF2;
	uint32_t bitoffDF3;
	uint32_t bitoffDF4;
	uint32_t bitoffDF5;
	uint32_t bitoffDF6;
	uint32_t bitoffDF7;
	uint32_t bitoffDF8;
	uint32_t bitoffDF9;
	uint32_t bitoffDF10;
	uint32_t bitoffDF11;
	uint32_t bitoffDF12;
	uint32_t bitoffDF13;
	uint32_t bitoffDF14;
	uint32_t bitoffDF15;
	uint32_t bitoffDF16;
	uint32_t bitoffRawFx;
	uint32_t bitoffRawFy;
	uint32_t bitoffRawFz;
	uint32_t bitoffRawTx;
	uint32_t bitoffRawTy;
	uint32_t bitoffRawTz;
	uint32_t bitoffOverloadStatus;
	uint32_t bitoffErrorFlag;	
};

struct SERVOTRONIX_MOTION_CONTROL_LTD__CDHD_IN
{
	//-------------- RxPdo1	0x1600
	uint16_t		ControlWord; 	// 0x6040
	int8_t		ModeOfOperation; 	// 0x6060
	//-------------- RxPdo2	0x1601
	int32_t		TargetPosition; 	// 0x607a
	uint32_t		ProfileVelocity; 	// 0x6081
	//-------------- RxPdo3	0x1602
	int32_t		TargetVelocity; 	// 0x60ff
	//-------------- RxPdo4	0x1603
	int16_t		TargetTorque; 	// 0x6071
	uint32_t		DigitalOutpus; 	// 0x60fe
	int16_t		TorqueOffset; 	// 0x60b2				
};
struct SERVOTRONIX_MOTION_CONTROL_LTD__CDHD_OUT
{
	//-------------- TxPdo1	0x1A00
	uint16_t		StatusWord; 	// 0x6041
	int8_t		ModeOfOperationDisplay; 	// 0x6061
	int16_t		TorqueActualValue; 	// 0x6077
	//-------------- TxPdo2	0x1A01
	int32_t		PositionActualValue; 	// 0x6064
	//-------------- TxPdo3	0x1A02
	int16_t		TorqueDemandValue; 	// 0x6074
	int16_t		AnalogInput1; 	// 0x20f2
	//-------------- TxPdo4	0x1A03
	uint32_t		DigitalInputs; 	// 0x60fd
	int32_t		ManuspecMachineHWPositionExternalcommand; 	// 0x20b6
	int32_t		FollowingErrorActualValue; 	// 0x60f4				
};
struct SERVOTRONIX_MOTION_CONTROL_LTD__CDHD
{
	ec_slave_config_t* Config;
	
	SERVOTRONIX_MOTION_CONTROL_LTD__CDHD_IN 	InParam;
	SERVOTRONIX_MOTION_CONTROL_LTD__CDHD_OUT 	OutParam;
	
	uint32_t offControlWord;
	uint32_t offModeOfOperation;
	uint32_t offTargetPosition;
	uint32_t offProfileVelocity;
	uint32_t offTargetVelocity;
	uint32_t offTargetTorque;
	uint32_t offDigitalOutpus;
	uint32_t offTorqueOffset;
	uint32_t offStatusWord;
	uint32_t offModeOfOperationDisplay;
	uint32_t offTorqueActualValue;
	uint32_t offPositionActualValue;
	uint32_t offTorqueDemandValue;
	uint32_t offAnalogInput1;
	uint32_t offDigitalInputs;
	uint32_t offManuspecMachineHWPositionExternalcommand;
	uint32_t offFollowingErrorActualValue;
	uint32_t bitoffControlWord;
	uint32_t bitoffModeOfOperation;
	uint32_t bitoffTargetPosition;
	uint32_t bitoffProfileVelocity;
	uint32_t bitoffTargetVelocity;
	uint32_t bitoffTargetTorque;
	uint32_t bitoffDigitalOutpus;
